Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Comment>(Общ) Номер расчетного счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНазначения</Name>
					<Comment>(Общ) Текст назначения платежа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Comment>(Общ) Расчетный, депозитный, ссудный, иной</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Comment>(Общ) Валюта, в которой хранятся денежные средства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИДатаРазрешения</Name>
					<Comment>(Регл) Номер и дата разрешения открытия счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Comment>(Общ) Дата открытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Comment>(Общ) Дата закрытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезКопеек</Name>
					<Comment>(Общ) Указывать сумму без копеек, если она в целых денежных еденицах</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСМС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСМС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оприходовать</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Карта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПоказывать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляБольшихСумм</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежиОтЭтойСуммы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЛимит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕГРПОУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Айди</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьБанковскуюВыписку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникБанковскойВыписки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиБанковскихВыписок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеОпераций</Name>
					<Comment>Какие операции загружать из выписки: только входящие, только исходящие или все. Пустое значение = все (для обратной совместимости с уже настроенными счетами).</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.НаправлениеБанковскихОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ВыставленныеСчетаКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ВыставленныеСчетаКонтрагентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ДвиженияДенежныхСредств</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте банковского счета (кассы)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриходРасход</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженийПриходРасход</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ОбъявлениеНаВзносНаличными</v8:Type>
						<v8:Type>cfg:DocumentRef.ДенежныйЧек</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ГТДИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПланированияПлатежа</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланируемоеПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасчетовСКонтрагентом</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаОтПокупателяПлатежнойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/БанковскиеСчета/Ext/ManagerModule.bsl
функция ПолучитьВыпискуДляВыставленияСчета(БанковскийСчет = Неопределено) Экспорт     
	
	Запрос = Новый Запрос;        	
	
	Запрос.Текст = 
	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БанковскиеСчета.Ссылка КАК БанковскийСчет,
		|	ПолучимВыставленныйСчет.Сумма КАК ВыставленнаяСумма,
		|	ПолучимСуммуЗаМесяц.СуммаУпрОборот КАК ЗаМесяц,
		|	ВЫБОР
		|		КОГДА БанковскиеСчета.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ ПолучимЗаГод.СуммаУпрОборот
		|	КОНЕЦ КАК СуммаЗаГод,
		|	БанковскиеСчета.Пользователь КАК Пользователь,
		|	ПолучимЗаГод.СуммаУпрОборот + ПолучимВыставленныйСчет.Сумма КАК Итого,
		|	БанковскиеСчета.Пользователь КАК ПользовательКод
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВыставленныеСчета.БанковскийСчет КАК БанковскийСчет,
		|			СУММА(ВыставленныеСчета.Сумма) КАК Сумма
		|		ИЗ
		|			РегистрСведений.ВыставленныеСчетаКонтрагентов КАК ВыставленныеСчета
		|
		|		СГРУППИРОВАТЬ ПО
		|			ВыставленныеСчета.БанковскийСчет) КАК ПолучимВыставленныйСчет
		|		ПО БанковскиеСчета.Ссылка = ПолучимВыставленныйСчет.БанковскийСчет
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СУММА(ДвиженияДенежныхСредствОбороты.СуммаУпрОборот) КАК СуммаУпрОборот,
		|			ДвиженияДенежныхСредствОбороты.БанковскийСчетКасса КАК БанковскийСчет
		|		ИЗ
		|			РегистрНакопления.ДвиженияДенежныхСредств.Обороты(
		|					&ДатаНачМесяца,
		|					&ДатаКон,
		|					,
		|					ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДенежныхСредств.Безналичные)
		|						И ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)) КАК ДвиженияДенежныхСредствОбороты
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ДвиженияДенежныхСредствОбороты.БанковскийСчетКасса) КАК ПолучимСуммуЗаМесяц
		|		ПО БанковскиеСчета.Ссылка = ПолучимСуммуЗаМесяц.БанковскийСчет
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СУММА(ДвиженияДенежныхСредствОбороты.СуммаУпрОборот) КАК СуммаУпрОборот,
		|			ДвиженияДенежныхСредствОбороты.БанковскийСчетКасса.Пользователь КАК БанковскийСчетКассаПользователь
		|		ИЗ
		|			РегистрНакопления.ДвиженияДенежныхСредств.Обороты(
		|					&ДатаНачалоГода,
		|					&ДатаКон,
		|					,
		|					ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДенежныхСредств.Безналичные)
		|						И ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)) КАК ДвиженияДенежныхСредствОбороты
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ДвиженияДенежныхСредствОбороты.БанковскийСчетКасса.Пользователь) КАК ПолучимЗаГод
		|		ПО БанковскиеСчета.Пользователь = ПолучимЗаГод.БанковскийСчетКассаПользователь
		|ГДЕ
		|	НЕ БанковскиеСчета.НеПоказывать
		|	И (БанковскиеСчета.Пользователь <> &Антон
		|			ИЛИ &ЭтоПользовательантон)
		|
		|УПОРЯДОЧИТЬ ПО
		|	БанковскиеСчета.Активный";
		
		
	Запрос.УстановитьПараметр("ДатаНачалоГода", НачалоГода(ТекущаяДата()));

	Запрос.УстановитьПараметр("Антон", Справочники.Пользователи.НайтиПоНаименованию("Антон"));
	Запрос.УстановитьПараметр("ЭтоПользовательантон", Истина);     //ПараметрыСеанса.ТекущийПользователь.Наименование = "Антон"
	 
	 
	Запрос.УстановитьПараметр("ДатаНачМесяца", НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(ТекущаяДата()));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Обновляет выставленный счёт контрагента: подбирает банковский счёт под сумму
// и сохраняет запись регистра ВыставленныеСчетаКонтрагентов.
//
// Вызывается параллельно из нескольких фоновых заданий (запись заказа, запись
// реализации, перераспределение резервов). Запись выполняется набором с отбором
// по контрагенту - это одна атомарная операция: платформа сама удаляет прежние
// записи контрагента и вставляет новую. Ни чтения-изменения-записи объекта, ни
// версий, ни дублей, ни ручных блокировок здесь больше нет.
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - контрагент, которому выставляется счёт.
//  Сумма      - Число                       - сумма к оплате.
//
// Возвращаемое значение:
//  Структура    - поля БанковскийСчет, Сумма, Дата - то, что записано контрагенту;
//  Неопределено - если контрагент не заполнен.
//
Функция ПолучитьВыставленныеСчета(Контрагент, Сумма) Экспорт

	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Неопределено;
	КонецЕсли;

	// Своя прежняя сумма исключается из контроля лимита: она будет заменена,
	// а не добавлена к уже выставленному по этому банковскому счёту.
	БанковскийСчет = ПолучитьСчетВыставления(Сумма, Контрагент, Контрагент);

	НаборЗаписей = РегистрыСведений.ВыставленныеСчетаКонтрагентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Контрагент.Установить(Контрагент);

	Запись = НаборЗаписей.Добавить();
	Запись.Контрагент     = Контрагент;
	Запись.БанковскийСчет = БанковскийСчет;
	Запись.Сумма          = Сумма;
	Запись.Дата           = ТекущаяДата();

	НаборЗаписей.Записать();

	Результат = Новый Структура("БанковскийСчет, Сумма, Дата");
	ЗаполнитьЗначенияСвойств(Результат, Запись);

	Возврат Результат;

КонецФункции

// Возвращает текущий выставленный счёт контрагента.
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - контрагент.
//
// Возвращаемое значение:
//  Структура - поля БанковскийСчет, Сумма, Дата;
//  Неопределено - если счёт контрагенту не выставлен.
//
Функция ПолучитьВыставленныйСчет(Контрагент) Экспорт

	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	             |	ВыставленныеСчета.БанковскийСчет КАК БанковскийСчет,
	             |	ВыставленныеСчета.Сумма КАК Сумма,
	             |	ВыставленныеСчета.Дата КАК Дата
	             |ИЗ
	             |	РегистрСведений.ВыставленныеСчетаКонтрагентов КАК ВыставленныеСчета
	             |ГДЕ
	             |	ВыставленныеСчета.Контрагент = &Контрагент";

	Запрос.УстановитьПараметр("Контрагент",Контрагент);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда

		Результат = Новый Структура("БанковскийСчет, Сумма, Дата");
		ЗаполнитьЗначенияСвойств(Результат, Выборка);

		Возврат Результат;

	КонецЕсли;

	Возврат Неопределено;

КонецФункции

функция МожноВыставитьСчет(Контрагент) Экспорт 
	  Возврат //не молдова не маруся и только оптовикам
	  
	    Контрагент.Регион.код <> "000000116"   
	  И Контрагент.Регион.Родитель.код <> "000000116"
	  И Контрагент.Регион.Родитель.Родитель.код <> "000000116"
	  И Контрагент.Регион.Родитель.Родитель.Родитель.код <> "000000116" 
	  И Контрагент.Код <> "000000364"
	  И Контрагент.ПолучитьОбъект().ЭтоОптовик();
КонецФункции

// Подбирает банковский счёт, на который можно выставить сумму с учётом лимитов.
//
// Параметры:
//  Сумма                 - Число                       - сумма к выставлению.
//  Контрагент            - СправочникСсылка.Контрагенты - контрагент.
//  ИсключаемыйКонтрагент - СправочникСсылка.Контрагенты - контрагент, чью текущую
//                            запись не нужно учитывать в контроле лимита: его прежняя
//                            сумма будет заменена, а не добавлена. Неопределено -
//                            учитывать все записи.
//
// Возвращаемое значение:
//  СправочникСсылка.БанковскиеСчета - подходящий счёт;
//  Неопределено                     - если счёт не найден.
//
Функция ПолучитьСчетВыставления(Сумма, Контрагент, ИсключаемыйКонтрагент = Неопределено) Экспорт

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ПолучитьВыставленныеСчета.Сумма, 0) КАК ВыставленнаяСумма,
		|	БанковскиеСчета.ЛимитСумма КАК ЛимитСумма,
		|	ПолучитьИнформациюЗаГод.СуммаЗаГодПоПользователю КАК СуммаЗаГодПоПользователю,
		|	БанковскиеСчета.Ссылка КАК БанковскийСчетКассаСсылка,
		|	ВЫБОР
		|		КОГДА БанковскиеСчета.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|			ТОГДА 1
		|		ИНАЧЕ 10
		|	КОНЕЦ КАК Порядок
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.СуммаУпрОборот КАК СуммаЗаГодПоПользователю,
		|		ДвиженияДенежныхСредствОбороты.СуммаУпрОборот КАК СуммаЗаГодПоСчету,
		|		ДвиженияДенежныхСредствОбороты.БанковскийСчетКасса.Ссылка КАК БанковскийСчетКассаСсылка,
		|		ДвиженияДенежныхСредствОбороты.БанковскийСчетКасса.Пользователь КАК БанковскийСчетКассаПользователь
		|	ИЗ
		|		РегистрНакопления.ДвиженияДенежныхСредств.Обороты(
		|				&ДатаНачалоГода,
		|				&ДатаКон,
		|				,
		|				ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДенежныхСредств.Безналичные)
		|					И ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)) КАК ДвиженияДенежныхСредствОбороты
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				СУММА(ДвиженияДенежныхСредствОбороты.СуммаУпрОборот) КАК СуммаУпрОборот,
		|				ДвиженияДенежныхСредствОбороты.БанковскийСчетКасса.Пользователь КАК БанковскийСчетКассаПользователь1
		|			ИЗ
		|				РегистрНакопления.ДвиженияДенежныхСредств.Обороты(
		|						&ДатаНачалоГода,
		|						&ДатаКон,
		|						,
		|						ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДенежныхСредств.Безналичные)
		|							И ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)) КАК ДвиженияДенежныхСредствОбороты
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ДвиженияДенежныхСредствОбороты.БанковскийСчетКасса.Пользователь) КАК ВложенныйЗапрос
		|			ПО ДвиженияДенежныхСредствОбороты.БанковскийСчетКасса.Пользователь = ВложенныйЗапрос.БанковскийСчетКассаПользователь1) КАК ПолучитьИнформациюЗаГод
		|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				СУММА(ВыставленныеСчета.Сумма) КАК Сумма,
		|				ВыставленныеСчета.БанковскийСчет КАК БанковскийСчет
		|			ИЗ
		|				РегистрСведений.ВыставленныеСчетаКонтрагентов КАК ВыставленныеСчета
		|			ГДЕ
		|				ВыставленныеСчета.Контрагент <> &ИсключаемыйКонтрагент
		|
		|			СГРУППИРОВАТЬ ПО
		|				ВыставленныеСчета.БанковскийСчет) КАК ПолучитьВыставленныеСчета
		|			ПО БанковскиеСчета.Ссылка = ПолучитьВыставленныеСчета.БанковскийСчет
		|		ПО ПолучитьИнформациюЗаГод.БанковскийСчетКассаСсылка = БанковскиеСчета.Ссылка
		|ГДЕ
		|	БанковскиеСчета.Активный
		|	И (ЕСТЬNULL(БанковскиеСчета.ПлатежиОтЭтойСуммы, 0) < &Сумма
		|				И БанковскиеСчета.ИспользоватьДляБольшихСумм
		|			ИЛИ НЕ БанковскиеСчета.ИспользоватьДляБольшихСумм)
		|	И (ЕСТЬNULL(ПолучитьВыставленныеСчета.Сумма, 0) + &Сумма < БанковскиеСчета.ЛимитСумма
		|			ИЛИ НЕ БанковскиеСчета.ИспользоватьЛимит)
		|	И НЕ БанковскиеСчета.НеПоказывать
		|	И БанковскиеСчета.Карта = &Карта
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	ЛимитСумма УБЫВ,
		|	ВыставленнаяСумма"; 
		
		ИспользоватьКарту = ИспользоватьКарту(Контрагент, Сумма);


		Запрос.УстановитьПараметр("ДатаНачалоГода", НачалоГода(ТекущаяДата()));
		Запрос.УстановитьПараметр("ДатаКон", НачалоДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("Карта", ИспользоватьКарту);
		Запрос.УстановитьПараметр("Сумма",Сумма);
		Запрос.УстановитьПараметр("ИсключаемыйКонтрагент",
			?(ИсключаемыйКонтрагент = Неопределено, Справочники.Контрагенты.ПустаяСсылка(), ИсключаемыйКонтрагент));

		Выборка = Запрос.Выполнить().Выбрать();

		// Отключённый отбор счёта "Моно" по остатку лимита - запрос оставлен как
		// комментарий вместе с использующим его блоком ниже.
		//ЗапросМоно = Новый Запрос;
		//ЗапросМоно.Текст = "ВЫБРАТЬ
		//               |	ЕСТЬNULL(СУММА(ВыставленныеСчета.Сумма), 0) КАК ВыставленнаяСумма,
		//               |	БанковскиеСчета.Ссылка КАК Ссылка
		//               |ИЗ
		//               |	Справочник.ВыставленныеСчета КАК ВыставленныеСчета
		//               |		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		//               |		ПО ВыставленныеСчета.БанковскийСчет = БанковскиеСчета.Ссылка
		//               |ГДЕ
		//               |	БанковскиеСчета.Код = ""000000021""
		//               |
		//               |СГРУППИРОВАТЬ ПО
		//               |	ВыставленныеСчета.БанковскийСчет,
		//               |	ВыставленныеСчета.Ссылка,
		//               |	БанковскиеСчета.Ссылка";



		Если Выборка.Следующий() Тогда
			//Если Выборка.БанковскийСчетКассаСсылка.Карта Тогда
			//	Моно = ЗапросМоно.Выполнить().Выгрузить()[0];
			//	Если Моно.ВыставленнаяСумма < 10000 Тогда
			//		Возврат Моно.Ссылка;
			//	КонецЕсли;
			//КонецЕсли;

			Возврат Выборка.БанковскийСчетКассаСсылка;
		КонецЕсли;       
		
		
		                                                                    
		Возврат Неопределено;
КонецФункции
	
// Снимает выставленный счёт контрагента.
//
// Пустой набор с отбором по контрагенту удаляет его записи одной операцией.
// Ошибка не пробрасывается: вызывающий код формирует файлы резервов и не должен
// падать целиком из-за служебной записи лимитов.
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - владелец записей.
//
Процедура УдалитьВыставленныйСчет(Контрагент)Экспорт

	Если Контрагент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Попытка

		НаборЗаписей = РегистрыСведений.ВыставленныеСчетаКонтрагентов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Контрагент.Установить(Контрагент);
		НаборЗаписей.Записать();

	Исключение

		ЗаписьЖурналаРегистрации(
			"ВыставленныеСчета",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.ВыставленныеСчетаКонтрагентов,
			Контрагент,
			"Не удалось удалить выставленный счёт: "
			+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

	КонецПопытки;

КонецПроцедуры

Функция ПолучитьБаноксвкийСчет(НомерСчета) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	    "ВЫБРАТЬ ПЕРВЫЕ 1
	    |	БанковскиеСчета.Ссылка КАК Ссылка
	    |ИЗ
	    |	Справочник.БанковскиеСчета КАК БанковскиеСчета
	    |ГДЕ
	    |	БанковскиеСчета.НомерСчета ПОДОБНО &Текст";
	
	Запрос.УстановитьПараметр("Текст", "%" + НомерСчета);
	
	
	 Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
        Возврат Выборка.Ссылка; // вернём сразу ссылку
    КонецЕсли;

	
КонецФункции

функция ЕстьСчетБезЛимита(ЭтоКарта, счет) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	БанковскиеСчета.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.БанковскиеСчета КАК БанковскиеСчета
	               |ГДЕ
	               |	БанковскиеСчета.Активный
	               |	И БанковскиеСчета.Карта = &Карта
	               |	И НЕ БанковскиеСчета.ИспользоватьЛимит
	               |	И БанковскиеСчета.Ссылка <> &счет"; 
	Запрос.УстановитьПараметр("Карта",ЭтоКарта);
	Запрос.УстановитьПараметр("счет",счет);
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Возврат Рез.Количество() <> 0; 
	
КонецФункции

функция ИспользоватьКарту(Контрагент, сумма = Неопределено) Экспорт 
	ПоследнийПлатежБылКарта = Ложь;
	Счет = Документы.ЗаказПокупателя.ПолучительПоследнийСчет(Контрагент);
	РучнойВыбор =  Документы.ЗаказПокупателя.ПолучитьРучнойВыборОплаты(Контрагент);
	
			
	Если ЗначениеЗаполнено(РучнойВыбор) Тогда
		Если РучнойВыбор Тогда 
			ПоследнийПлатежБылКарта = Истина;	
		КонецЕсли; 
	Иначе
		Если ЗначениеЗаполнено(Сумма) И Сумма < Константы.НаКартуСуумыДо.Получить()  Тогда
			Возврат Истина;
		КонецЕсли;  
		
		Если Сумма = Неопределено или Сумма > 10000 Тогда 
			Возврат Ложь;
		КонецЕсли;
				
		Если ЗначениеЗАполнено(Счет) Тогда
			ПоследнийПлатежБылКарта = Счет.Карта;
		КонецЕсли;
	КонецЕсли;

	Возврат ПоследнийПлатежБылКарта;
	
КонецФункции 

функция ПолучитьБанковскийСчетБезЛимита(Контрагент) Экспорт

	
	ИспользоватьКарту = ИспользоватьКарту(Контрагент);
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Карта",ИспользоватьКарту);

	
	Запрос.Текст = "ВЫБРАТЬ
	               |	БанковскиеСчета.Ссылка КАК Счет
	               |ИЗ
	               |	Справочник.БанковскиеСчета КАК БанковскиеСчета
	               |ГДЕ
	               |	БанковскиеСчета.Активный
	               |	И БанковскиеСчета.Карта = &Карта
	               |	И НЕ БанковскиеСчета.ИспользоватьЛимит
				   //|	И БанковскиеСчета.Пользователь <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
				    |";
	
	
	Выборка = Запрос.Выполнить().Выбрать();	
		
	Пока Выборка.Следующий() Цикл 
		Возврат Выборка.Счет;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции


Функция СоздатьБанковскийСчетОрганизации(Получатель, КодПолучателя, IBAN, НазначениеПлатежа) Экспорт
	
	IBAN = СтрЗаменить(IBAN, " ", "");
	
	Если Не ЗначениеЗаполнено(IBAN) Тогда
		ВызватьИсключение "Не указан IBAN";
	КонецЕсли;
	
	Организация = Справочники.Организации.НайтиПоКоду("000000001");
	
	Если Организация.Пустая() Тогда
		ВызватьИсключение "Не найдена организация с кодом 000000001";
	КонецЕсли;
	
	// Проверяем, есть ли уже такой счет у организации
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	БанковскиеСчета.Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец = &Владелец
	|	И БанковскиеСчета.НомерСчета = &IBAN";
	
	Запрос.УстановитьПараметр("Владелец", Организация);
	Запрос.УстановитьПараметр("IBAN", IBAN);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	// Создаем новый банковский счет
	Счет = Справочники.БанковскиеСчета.СоздатьЭлемент();
	
	Счет.Банк = Справочники.Банки.НайтиПоНаименованию("Приват");
	Счет.Владелец = Организация;
	Счет.ФИО = Получатель;
	Счет.НомерСчета = IBAN;
	Счет.ЕГРПОУ = КодПолучателя;
    Счет.ТекстНазначения = НазначениеПлатежа;
    Счет.Карта = Ложь; 
	Счет.Активный = Истина;
	
	Счет.ПолучитьФорму().Открыть();
	//Счет.Записать();
	
	Возврат Счет.Ссылка;
	
КонецФункции  

Функция РазобратьБанковскиеРеквизиты(Текст) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КодПолучателя", "");
	Результат.Вставить("Получатель", "");
	Результат.Вставить("IBAN", "");
	Результат.Вставить("НазначениеПлатежа", "");
	
	Результат.IBAN = ПолучитьIBANИзТекста(Текст);
	Результат.Получатель = ПолучитьПолучателяИзТекста(Текст);
	Результат.КодПолучателя = ПолучитьКодПолучателяИзТекста(Текст);
	Результат.НазначениеПлатежа = ПолучитьНазначениеИзТекста(Текст);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьIBANИзТекста(Текст)
	
	ТекстВерх = ВРег(Текст);
	Позиция = Найти(ТекстВерх, "UA");
	
	Пока Позиция > 0 Цикл
		
		IBAN = "";
		Индекс = Позиция;
		
		Пока Индекс <= СтрДлина(Текст) И СтрДлина(IBAN) < 29 Цикл
			
			Символ = Сред(Текст, Индекс, 1);
			СимволВерх = ВРег(Символ);
			
			Если Символ = " " Тогда
				// пропускаем пробелы
			ИначеЕсли Найти("ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789", СимволВерх) > 0 Тогда
				IBAN = IBAN + СимволВерх;
			Иначе
				Если СтрДлина(IBAN) > 2 Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
			Индекс = Индекс + 1;
			
		КонецЦикла;
		
		Если Лев(IBAN, 2) = "UA" И СтрДлина(IBAN) = 29 Тогда
			Возврат IBAN;
		КонецЕсли;
		
		СледующаяПозиция = Найти(Сред(ТекстВерх, Позиция + 2), "UA");
		Если СледующаяПозиция = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Позиция = Позиция + 2 + СледующаяПозиция - 1;
		
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

Функция ПолучитьПолучателяИзТекста(Текст)
	
	Для НомерСтроки = 1 По СтрЧислоСтрок(Текст) Цикл
		
		СтрокаТекста = СокрЛП(СтрПолучитьСтроку(Текст, НомерСтроки));
		ПозицияФОП = Найти(ВРег(СтрокаТекста), "ФОП ");
		
		Если ПозицияФОП > 0 Тогда
			Возврат СокрЛП(Сред(СтрокаТекста, ПозицияФОП));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

Функция ПолучитьКодПолучателяИзТекста(Текст)
	
	Метки = Новый Массив;
	Метки.Добавить("Код отримувача");
	Метки.Добавить("ІПН/ЄДРПОУ");
	Метки.Добавить("ИПН/ЕДРПОУ");
	Метки.Добавить("ЄДРПОУ");
	Метки.Добавить("ЕДРПОУ");
	
	Для НомерСтроки = 1 По СтрЧислоСтрок(Текст) Цикл
		
		СтрокаТекста = СокрЛП(СтрПолучитьСтроку(Текст, НомерСтроки));
		СтрокаВерх = ВРег(СтрокаТекста);
		
		Для Каждого Метка Из Метки Цикл
			
			Если Найти(СтрокаВерх, ВРег(Метка)) > 0 Тогда
				
				Код = ТолькоЦифры(СтрокаТекста);
				
				Если ПустаяСтрока(Код) И НомерСтроки < СтрЧислоСтрок(Текст) Тогда
					Код = ТолькоЦифры(СтрПолучитьСтроку(Текст, НомерСтроки + 1));
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Код) Тогда
					Возврат Код;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

Функция ПолучитьНазначениеИзТекста(Текст)
	
	Для НомерСтроки = 1 По СтрЧислоСтрок(Текст) Цикл
		
		СтрокаТекста = СокрЛП(СтрПолучитьСтроку(Текст, НомерСтроки));
		Позиция = Найти(ВРег(СтрокаТекста), "ЗА ");
		
		Если Позиция > 0 Тогда
			Возврат СокрЛП(Сред(СтрокаТекста, Позиция));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

Функция ТолькоЦифры(СтрокаТекста)
	
	Результат = "";
	
	Для Индекс = 1 По СтрДлина(СтрокаТекста) Цикл
		
		Символ = Сред(СтрокаТекста, Индекс, 1);
		
		Если Найти("0123456789", Символ) > 0 Тогда
			Результат = Результат + Символ;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции






// кр код 
Функция NBU_QR_СформироватьQR(Получатель, IBAN, КодПолучателя, Сумма = 0, Назначение = "", Размер = "300x300") Экспорт
	
	Попытка
		
		СтруктураДанных = NBU_QR_СформироватьСтруктуруДанных(Получатель, IBAN, КодПолучателя, Сумма, Назначение);
		Base64UrlСтрока = NBU_QR_Base64UrlИзСтроки(СтруктураДанных);
		СсылкаНБУ = "https://bank.gov.ua/qr/" + Base64UrlСтрока;
		
		QRДвоичныеДанные = NBU_QR_ПолучитьPNGПоСтроке(СсылкаНБУ, Размер);
		
		Возврат Новый Структура(
			"Успех, СтруктураДанных, СтрокаBase64URL, СсылкаНБУ, QRДвоичныеДанные, Сообщение",
			Истина,
			СтруктураДанных,
			Base64UrlСтрока,
			СсылкаНБУ,
			QRДвоичныеДанные,
			""
		);
		
	Исключение
		
		Возврат Новый Структура(
			"Успех, СтруктураДанных, СтрокаBase64URL, СсылкаНБУ, QRДвоичныеДанные, Сообщение",
			Ложь,
			"",
			"",
			"",
			Неопределено,
			ОписаниеОшибки()
		);
		
	КонецПопытки;
	
КонецФункции

Функция NBU_QR_СформироватьСтруктуруДанных(Получатель, IBAN, КодПолучателя, Сумма, Назначение) Экспорт
	
	Получатель1 = СокрЛП(Строка(Получатель));
	IBAN1 = СтрЗаменить(СокрЛП(Строка(IBAN)), " ", "");
	КодПолучателя1 = СокрЛП(Строка(КодПолучателя));
	Назначение1 = СокрЛП(Строка(Назначение));
	
	СтрокаСуммы = "UAH" + NBU_QR_ФорматСуммы(Сумма);
	
	Возврат
		"BCD" + Символы.ПС
		+ "002" + Символы.ПС
		+ "1" + Символы.ПС
		+ "UCT" + Символы.ПС
		+ Символы.ПС
		+ Получатель1 + Символы.ПС
		+ IBAN1 + Символы.ПС
		+ СтрокаСуммы + Символы.ПС
		+ КодПолучателя1 + Символы.ПС
		+ Символы.ПС
		+ Символы.ПС
		+ Назначение1;
	
КонецФункции

Функция NBU_QR_ФорматСуммы(Сумма) Экспорт
	
	СтрокаСуммы = Формат(Сумма, "ЧГ=0; ЧДЦ=2; ЧРД=.; ЧРГ=");
	СтрокаСуммы = СтрЗаменить(СтрокаСуммы, ",", ".");
	СтрокаСуммы = СтрЗаменить(СтрокаСуммы, " ", "");
	
	Возврат СтрокаСуммы;
	
КонецФункции

Функция NBU_QR_ПолучитьPNGПоСтроке(СтрокаДляQR, Размер = "300x300") Экспорт
	
	Попытка
		
		ЗакодированнаяСтрока = NBU_QR_URLКодировать(СтрокаДляQR);
		URL = "/v1/create-qr-code/?size=" + Размер + "&data=" + ЗакодированнаяСтрока;
		
		Соединение = Новый HTTPСоединение("api.qrserver.com", 443, , , , , Истина);
		Запрос = Новый HTTPЗапрос(URL);
		
		Ответ = Соединение.ОтправитьДляОбработки(Запрос);
		
		Если Ответ.КодСостояния <> 200 Тогда
			ВызватьИсключение "QR API вернул код " + Строка(Ответ.КодСостояния);
		КонецЕсли;
		
		Возврат Ответ.ПолучитьТелоКакДвоичныеДанные();
		
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция NBU_QR_URLКодировать(ИсходнаяСтрока) Экспорт
	
	Результат = "";
	ДлинаСтроки = СтрДлина(ИсходнаяСтрока);
	
	Для Номер = 1 По ДлинаСтроки Цикл
		
		Символ = Сред(ИсходнаяСтрока, Номер, 1);
		Код = КодСимвола(Символ);
		
		// A-Z
		Если (Код >= 65 И Код <= 90)
			// a-z
			Или (Код >= 97 И Код <= 122)
			// 0-9
			Или (Код >= 48 И Код <= 57)
			// безопасные символы
			Или Символ = "-"
			Или Символ = "_"
			Или Символ = "."
			Или Символ = "~" Тогда
			
			Результат = Результат + Символ;
			
		ИначеЕсли Код = 10 Тогда // LF
			Результат = Результат + "%0A";
			
		ИначеЕсли Код = 13 Тогда // CR
			Результат = Результат + "%0D";
			
		ИначеЕсли Код <= 127 Тогда
			Результат = Результат + "%" + NBU_QR_ВHex2(Код);
			
		Иначе
			// Для кириллицы и других не-ASCII символов
			// кодируем как UTF-8
			Результат = Результат + NBU_QR_СимволВURL_UTF8(Символ);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции   

Функция NBU_QR_ВHex2(ЧислоЗначение) Экспорт
	
	Хекс = "";
	Остаток = ЧислоЗначение;
	
	Пока Остаток > 0 Цикл
		Цифра = Остаток % 16;
		
		Если Цифра < 10 Тогда
			Хекс = Строка(Цифра) + Хекс;
		Иначе
			Если Цифра = 10 Тогда Хекс = "A" + Хекс; КонецЕсли;
			Если Цифра = 11 Тогда Хекс = "B" + Хекс; КонецЕсли;
			Если Цифра = 12 Тогда Хекс = "C" + Хекс; КонецЕсли;
			Если Цифра = 13 Тогда Хекс = "D" + Хекс; КонецЕсли;
			Если Цифра = 14 Тогда Хекс = "E" + Хекс; КонецЕсли;
			Если Цифра = 15 Тогда Хекс = "F" + Хекс; КонецЕсли;
		КонецЕсли;
		
		Остаток = Цел(Остаток / 16);
	КонецЦикла;
	
	Пока СтрДлина(Хекс) < 2 Цикл
		Хекс = "0" + Хекс;
	КонецЦикла;
	
	Возврат Хекс;
	
КонецФункции

Функция NBU_QR_СимволВURL_UTF8(Символ) Экспорт
	
	Код = КодСимвола(Символ);
	Результат = "";
	
	Если Код <= 127 Тогда
		Возврат "%" + NBU_QR_ВHex2(Код);
	КонецЕсли;
	
	Если Код <= 2047 Тогда
		
		Байт1 = 192 + Цел(Код / 64);
		Байт2 = 128 + (Код % 64);
		
		Результат = "%" + NBU_QR_ВHex2(Байт1);
		Результат = Результат + "%" + NBU_QR_ВHex2(Байт2);
		
		Возврат Результат;
		
	КонецЕсли;
	
	// 3-байтовый UTF-8
	Байт1 = 224 + Цел(Код / 4096);
	Байт2 = 128 + (Цел(Код / 64) % 64);
	Байт3 = 128 + (Код % 64);
	
	Результат = "%" + NBU_QR_ВHex2(Байт1);
	Результат = Результат + "%" + NBU_QR_ВHex2(Байт2);
	Результат = Результат + "%" + NBU_QR_ВHex2(Байт3);
	
	Возврат Результат;
	
КонецФункции

Функция NBU_QR_СохранитьВоВременныйФайл(QRДвоичныеДанные, Расширение = "png") Экспорт
	
	Если QRДвоичныеДанные = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ИмяФайла = ПолучитьИмяВременногоФайла(Расширение);
	QRДвоичныеДанные.Записать(ИмяФайла);
	
	Возврат ИмяФайла;
	
КонецФункции

Функция NBU_QR_ПолучитьКартинку(QRДвоичныеДанные) Экспорт
	
	ИмяФайла = NBU_QR_СохранитьВоВременныйФайл(QRДвоичныеДанные, "png");
	
	Если ПустаяСтрока(ИмяФайла) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Новый Картинка(ИмяФайла);
	
КонецФункции  

Функция NBU_QR_Base64UrlИзСтроки(ИсходнаяСтрока) Экспорт
	
	ИмяФайла = ПолучитьИмяВременногоФайла("txt");
	
	Попытка
		
		// 1. Пишем текст в UTF-8
		ТекстовыйПоток = Новый COMОбъект("ADODB.Stream");
		ТекстовыйПоток.Type = 2; // текст
		ТекстовыйПоток.Charset = "utf-8";
		ТекстовыйПоток.Open();
		ТекстовыйПоток.WriteText(ИсходнаяСтрока);
		
		// 2. Переключаем в бинарный режим
		ТекстовыйПоток.Position = 0;
		ТекстовыйПоток.Type = 1; // binary
		
		// 3. Пропускаем BOM UTF-8
		Если ТекстовыйПоток.Size >= 3 Тогда
			ТекстовыйПоток.Position = 3;
		Иначе
			ТекстовыйПоток.Position = 0;
		КонецЕсли;
		
		// 4. Читаем данные БЕЗ BOM
		БинарныеДанныеБезBOM = ТекстовыйПоток.Read();
		ТекстовыйПоток.Close();
		
		// 5. Сохраняем эти данные в новый бинарный поток
		БинарныйПоток = Новый COMОбъект("ADODB.Stream");
		БинарныйПоток.Type = 1; // binary
		БинарныйПоток.Open();
		БинарныйПоток.Write(БинарныеДанныеБезBOM);
		БинарныйПоток.Position = 0;
		БинарныйПоток.SaveToFile(ИмяФайла, 2);
		БинарныйПоток.Close();
		
		// 6. Читаем как ДвоичныеДанные
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла);
		
		// 7. Base64
		СтрокаBase64 = Base64Строка(ДвоичныеДанные);
		
		СтрокаBase64 = СтрЗаменить(СтрокаBase64, Символы.ПС, "");
		СтрокаBase64 = СтрЗаменить(СтрокаBase64, Символы.ВК, "");   
		
		// 8. Base64URL
		СтрокаBase64 = СтрЗаменить(СтрокаBase64, "+", "-");
		СтрокаBase64 = СтрЗаменить(СтрокаBase64, "/", "_");
		СтрокаBase64 = СтрЗаменить(СтрокаBase64, "=", "");
		
		Возврат СтрокаBase64;
		
	Исключение
		ВызватьИсключение "Ошибка преобразования строки в Base64URL: " + ОписаниеОшибки();
	КонецПопытки;
	
КонецФункции
// кр код
